#!/usr/bin/env bash

func_test ()
{
    echo "--------------------------------------------------------------"
    echo "                       TEST $IP"
    ping -c1 "$IP"
    echo "--------------------------------------------------------------"
}

#проверяем сетевую связанность роутеров и доступность 8.8.8.8
echo "--------------------------------------------------------------"
echo "           проверяем сетевую связанность роутеров и доступность 8.8.8.8"
for IP in 192.168.255.1 192.168.255.2 192.168.254.1 192.168.254.2 192.168.253.1 192.168.253.2
    do
       func_test
done

#проверяем сетевую связанность сети central
echo "           проверяем сетевую связанность сети central"
for IP in 192.168.0.1 192.168.0.2 192.168.0.33 192.168.0.65
    do
       func_test
done

#проверяем сетевую связанность сети office1
echo "           проверяем сетевую связанность сети office1"
for IP in 192.168.2.1 192.168.2.65 192.168.2.66 192.168.2.129 192.168.2.193
    do
       func_test
done

#проверяем сетевую связанность сети office2
echo "           проверяем сетевую связанность сети office2"
for IP in 192.168.1.1 192.168.1.129 192.168.1.130 192.168.1.193
    do
       func_test
done
